tiborsimon/embedded-tdd-headers/pic/pic18/pic18f4220_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC18F4220_H_
#define _PIC18F4220_H_

#define PORTA                         0
#define AN0                           1
#define ULPWUIN                       2
#define PORTA_RA0                     3
#define AN1                           4
#define PORTA_RA1                     5
#define AN2                           6
#define PORTA_RA2                     7
#define CVREF                         8
#define VREFM                         9
#define AN3                           10
#define PORTA_RA3                     11
#define VREFP                         12
#define PORTA_RA4                     13
#define PORTA_C1OUT                   14
#define T0CKI                         15
#define PORTA_C2OUT                   16
#define AN4                           17
#define PORTA_RA5                     18
#define LVDIN                         19
#define nSS                           20
#define NOT_SS                        21
#define SS                            22
#define CLKO                          23
#define PORTA_RA6                     24
#define OSC2                          25
#define CLKI                          26
#define PORTA_RA7                     27
#define OSC1                          28
#define RJPU                          29
#define PORTB                         30
#define INT0                          31
#define PORTB_RB0                     32
#define AN12                          33
#define INT1                          34
#define PORTB_RB1                     35
#define AN10                          36
#define AN8                           37
#define INT2                          38
#define PORTB_RB2                     39
#define CCP2A                         40
#define AN9                           41
#define PORTB_CCP2                    42
#define CCP2_PA2                      43
#define PORTB_RB3                     44
#define KBI0                          45
#define PORTB_RB4                     46
#define AN11                          47
#define PGM                           48
#define PORTB_RB5                     49
#define KBI1                          50
#define PGC                           51
#define PORTB_RB6                     52
#define KBI2                          53
#define PGD                           54
#define PORTB_RB7                     55
#define KBI3                          56
#define PORTC                         57
#define T13CKI                        58
#define T1CKI                         59
#define T1OSO                         60
#define PORTC_RC0                     61
#define PORTC_CCP2                    62
#define T1OSI                         63
#define PA2                           64
#define PORTC_RC1                     65
#define CCP1                          66
#define P1A                           67
#define PA1                           68
#define PORTC_RC2                     69
#define SCL                           70
#define SCK                           71
#define PORTC_RC3                     72
#define SDA                           73
#define SDI                           74
#define PORTC_RC4                     75
#define SDO                           76
#define PORTC_RC5                     77
#define TX                            78
#define CK                            79
#define PORTC_RC6                     80
#define DT                            81
#define RX                            82
#define PORTC_RC7                     83
#define PORTD                         84
#define PSP0                          85
#define PORTD_RD0                     86
#define PSP1                          87
#define PORTD_RD1                     88
#define PSP2                          89
#define PORTD_RD2                     90
#define PSP3                          91
#define PORTD_RD3                     92
#define PSP4                          93
#define PORTD_RD4                     94
#define PSP5                          95
#define P1B                           96
#define PORTD_RD5                     97
#define PSP6                          98
#define P1C                           99
#define PORTD_RD6                     100
#define SS2                           101
#define PSP7                          102
#define P1D                           103
#define PORTD_RD7                     104
#define PORTE                         105
#define NOT_RD                        106
#define nRD                           107
#define AN5                           108
#define PORTE_RD                      109
#define PD2                           110
#define RDE                           111
#define PORTE_RE0                     112
#define AN6                           113
#define WRE                           114
#define PORTE_WR                      115
#define NOT_WR                        116
#define nWR                           117
#define PORTE_RE1                     118
#define PC2                           119
#define nCS                           120
#define NOT_CS                        121
#define AN7                           122
#define CCP10                         123
#define PB2                           124
#define CS                            125
#define PORTE_RE2                     126
#define CCP9E                         127
#define PORTE_RE3                     128
#define MCLR                          129
#define PC3E                          130
#define LATA                          131
#define LATA0                         132
#define LA0                           133
#define LATA1                         134
#define LA1                           135
#define LATA2                         136
#define LA2                           137
#define LATA3                         138
#define LA3                           139
#define LATA4                         140
#define LA4                           141
#define LATA5                         142
#define LA5                           143
#define LATA6                         144
#define LA6                           145
#define LATA7                         146
#define LA7                           147
#define LATB                          148
#define LB0                           149
#define LATB0                         150
#define LB1                           151
#define LATB1                         152
#define LB2                           153
#define LATB2                         154
#define LB3                           155
#define LATB3                         156
#define LB4                           157
#define LATB4                         158
#define LB5                           159
#define LATB5                         160
#define LB6                           161
#define LATB6                         162
#define LB7                           163
#define LATB7                         164
#define LATC                          165
#define LATC0                         166
#define LC0                           167
#define LATC1                         168
#define LC1                           169
#define LATC2                         170
#define LC2                           171
#define LATC3                         172
#define LC3                           173
#define LATC4                         174
#define LC4                           175
#define LATC5                         176
#define LC5                           177
#define LATC6                         178
#define LC6                           179
#define LATC7                         180
#define LC7                           181
#define LATD                          182
#define LATD0                         183
#define LD0                           184
#define LATD1                         185
#define LD1                           186
#define LATD2                         187
#define LD2                           188
#define LATD3                         189
#define LD3                           190
#define LATD4                         191
#define LD4                           192
#define LATD5                         193
#define LD5                           194
#define LATD6                         195
#define LD6                           196
#define LATD7                         197
#define LD7                           198
#define LATE                          199
#define LATE0                         200
#define LE0                           201
#define LATE1                         202
#define LE1                           203
#define LATE2                         204
#define LE2                           205
#define TRISA                         206
#define TRISA0                        207
#define TRISA_RA0                     208
#define TRISA1                        209
#define TRISA_RA1                     210
#define TRISA2                        211
#define TRISA_RA2                     212
#define TRISA3                        213
#define TRISA_RA3                     214
#define TRISA_RA4                     215
#define TRISA4                        216
#define TRISA_RA5                     217
#define TRISA5                        218
#define TRISA_RA6                     219
#define TRISA6                        220
#define TRISA_RA7                     221
#define TRISA7                        222
#define TRISB                         223
#define TRISB_RB0                     224
#define TRISB0                        225
#define TRISB_RB1                     226
#define TRISB1                        227
#define TRISB_RB2                     228
#define TRISB2                        229
#define TRISB_RB3                     230
#define TRISB3                        231
#define TRISB_RB4                     232
#define TRISB4                        233
#define TRISB_RB5                     234
#define TRISB5                        235
#define TRISB_RB6                     236
#define TRISB6                        237
#define TRISB_RB7                     238
#define TRISB7                        239
#define TRISC                         240
#define TRISC0                        241
#define TRISC_RC0                     242
#define TRISC1                        243
#define TRISC_RC1                     244
#define TRISC2                        245
#define TRISC_RC2                     246
#define TRISC3                        247
#define TRISC_RC3                     248
#define TRISC4                        249
#define TRISC_RC4                     250
#define TRISC5                        251
#define TRISC_RC5                     252
#define TRISC6                        253
#define TRISC_RC6                     254
#define TRISC7                        255
#define TRISC_RC7                     256
#define TRISD                         257
#define TRISD_RD0                     258
#define TRISD0                        259
#define TRISD_RD1                     260
#define TRISD1                        261
#define TRISD_RD2                     262
#define TRISD2                        263
#define TRISD_RD3                     264
#define TRISD3                        265
#define TRISD_RD4                     266
#define TRISD4                        267
#define TRISD_RD5                     268
#define TRISD5                        269
#define TRISD_RD6                     270
#define TRISD6                        271
#define TRISD_RD7                     272
#define TRISD7                        273
#define TRISE                         274
#define TRISE_RE0                     275
#define TRISE0                        276
#define TRISE_RE1                     277
#define TRISE1                        278
#define TRISE_RE2                     279
#define TRISE2                        280
#define TRISE_RE3                     281
#define PSPMODE                       282
#define IBOV                          283
#define OBF                           284
#define IBF                           285
#define OSCTUN2                       286
#define OSCTUN2_TUN0                  287
#define OSCTUN2_TUN                   288
#define OSCTUN2_TUN1                  289
#define OSCTUN2_TUN2                  290
#define OSCTUN2_TUN3                  291
#define OSCTUN2_TUN4                  292
#define OSCTUN2_TUN5                  293
#define TUNSEL                        294
#define OSCTUNE                       295
#define OSCTUNE_TUN                   296
#define OSCTUNE_TUN0                  297
#define OSCTUNE_TUN1                  298
#define OSCTUNE_TUN2                  299
#define OSCTUNE_TUN3                  300
#define OSCTUNE_TUN4                  301
#define OSCTUNE_TUN5                  302
#define PIE1                          303
#define TMR1IE                        304
#define TMR2IE                        305
#define CCP1IE                        306
#define SSPIE                         307
#define TXIE                          308
#define TX1IE                         309
#define RCIE                          310
#define RC1IE                         311
#define ADIE                          312
#define PSPIE                         313
#define PIR1                          314
#define TMR1IF                        315
#define TMR2IF                        316
#define CCP1IF                        317
#define SSPIF                         318
#define TXIF                          319
#define TX1IF                         320
#define RCIF                          321
#define RC1IF                         322
#define ADIF                          323
#define PSPIF                         324
#define IPR1                          325
#define TMR1IP                        326
#define TMR2IP                        327
#define CCP1IP                        328
#define SSPIP                         329
#define TX1IP                         330
#define TXIP                          331
#define RC1IP                         332
#define RCIP                          333
#define ADIP                          334
#define PSPIP                         335
#define PIE2                          336
#define CCP2IE                        337
#define TMR3IE                        338
#define LVDIE                         339
#define BCLIE                         340
#define EEIE                          341
#define CMIE                          342
#define OSCFIE                        343
#define PIR2                          344
#define CCP2IF                        345
#define TMR3IF                        346
#define LVDIF                         347
#define BCLIF                         348
#define EEIF                          349
#define CMIF                          350
#define OSCFIF                        351
#define IPR2                          352
#define CCP2IP                        353
#define TMR3IP                        354
#define LVDIP                         355
#define BCLIP                         356
#define EEIP                          357
#define CMIP                          358
#define OSCFIP                        359
#define EECON1                        360
#define EECON1_RD                     361
#define EECON1_WR                     362
#define WREN                          363
#define WRERR                         364
#define FREE                          365
#define CFGS                          366
#define EEFS                          367
#define EEPGD                         368
#define RCSTA                         369
#define RCD8                          370
#define RX9D                          371
#define OERR                          372
#define FERR                          373
#define ADDEN                         374
#define ADEN                          375
#define CREN                          376
#define SRENA                         377
#define SREN                          378
#define RC9                           379
#define RC8_9                         380
#define RX9                           381
#define SPEN                          382
#define TXSTA                         383
#define TXD8                          384
#define TX9D1                         385
#define TX9D                          386
#define TRMT                          387
#define TRMT1                         388
#define BRGH1                         389
#define BRGH                          390
#define SYNC                          391
#define SYNC1                         392
#define TXEN1                         393
#define TXEN                          394
#define TX91                          395
#define TX8_9                         396
#define TX9                           397
#define CSRC1                         398
#define CSRC                          399
#define T3CON                         400
#define TMR3ON                        401
#define TMR3CS                        402
#define nT3SYNC                       403
#define NOT_T3SYNC                    404
#define T3SYNC                        405
#define SOSCEN3                       406
#define T3CCP1                        407
#define T3CKPS                        408
#define T3CKPS0                       409
#define T3CKPS1                       410
#define T3CCP2                        411
#define T3CON_RD16                    412
#define RD163                         413
#define T3RD16                        414
#define CMCON                         415
#define CM                            416
#define CMEN0                         417
#define CM0                           418
#define CMEN1                         419
#define CM1                           420
#define CMEN2                         421
#define CM2                           422
#define CIS                           423
#define C1INV                         424
#define C2INV                         425
#define CMCON_C1OUT                   426
#define CMCON_C2OUT                   427
#define CVRCON                        428
#define CVR                           429
#define CVR0                          430
#define CVR1                          431
#define CVR2                          432
#define CVR3                          433
#define CVRR                          434
#define CVROEN                        435
#define CVROE                         436
#define CVREN                         437
#define PSSBD                         438
#define PSSBD0                        439
#define PSSBD1                        440
#define PSSAC                         441
#define PSSAC0                        442
#define PSSAC1                        443
#define ECCPAS0                       444
#define ECCPAS                        445
#define ECCPAS1                       446
#define ECCPAS2                       447
#define ECCPASE                       448
#define PWM1CON                       449
#define PDC0                          450
#define PDC                           451
#define PDC1                          452
#define PDC2                          453
#define PDC3                          454
#define PDC4                          455
#define PDC5                          456
#define PDC6                          457
#define PRSEN                         458
#define CCP2CON                       459
#define CCP2M                         460
#define CCP2M0                        461
#define CCP2M1                        462
#define CCP2M2                        463
#define CCP2M3                        464
#define DC2B0                         465
#define DCP2Y                         466
#define CCP2Y                         467
#define DC2B                          468
#define DC2B1                         469
#define DCP2X                         470
#define CCP2X                         471
#define CCP1CON                       472
#define CCP1M0                        473
#define CCP1M                         474
#define CCP1M1                        475
#define CCP1M2                        476
#define CCP1M3                        477
#define DCP1Y                         478
#define CCP1Y                         479
#define DC1B                          480
#define DC1B0                         481
#define CCP1X                         482
#define DC1B1                         483
#define DCP1X                         484
#define P1M                           485
#define P1M0                          486
#define P1M1                          487
#define ADCON2                        488
#define ADCS0                         489
#define ADCS                          490
#define ADCS1                         491
#define ADCS2                         492
#define ACQT0                         493
#define ACQT                          494
#define ACQT1                         495
#define ACQT2                         496
#define ADFM                          497
#define ADCON1                        498
#define PCFG0                         499
#define PCFG                          500
#define PCFG1                         501
#define PCFG2                         502
#define CHSN3                         503
#define PCFG3                         504
#define VCFG                          505
#define VCFG0                         506
#define VCFG01                        507
#define VCFG11                        508
#define VCFG1                         509
#define ADCON0                        510
#define ADON                          511
#define nDONE                         512
#define GO_nDONE                      513
#define NOT_DONE                      514
#define GODONE                        515
#define GO_DONE                       516
#define DONE                          517
#define GO_NOT_DONE                   518
#define GO                            519
#define CHS                           520
#define CHS0                          521
